Revit 2027 API
PanelScheduleData.IsAutoShadingForLoadDisplay Property
 Display shading of load cells automatically or not.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsAutoShadingForLoadDisplay { get; set; }
Public Property IsAutoShadingForLoadDisplay As Boolean
	Get
	Set
public:
property bool IsAutoShadingForLoadDisplay {
	bool get ();
	void set (bool value);
}
member IsAutoShadingForLoadDisplay : bool with get, set
Property Value
Boolean
See Also
Reference
PanelScheduleData Class
Autodesk.Revit.DB.Electrical Namespace